package com.meme.translator.emotion_meme_translator.data;

public class EmotionTemplateData {

    // ID에 따라 템플릿 반환
    public static String getTemplateById(Long memeId) {
        switch (memeId.intValue()) {
            case 0:
                return "내가 하는 말을 아래 밈(템플릿) 양식에 맞춰서 치환해줘 \n" +
                        "\n" +
                        "저쪽 집이 무너졌다고 해서 구경하러 갔죠, 그런데 보고 오니 우리 집이 무너진 거예요 보자마자 눈물이 났어요.\n" +
                        "\n" +
                        "예를 들면 이런식이야\n" +
                        "\n" +
                        "나는 지금 전 여자친구를 만났어..\n" +
                        "\n" +
                        "저쪽 커플이 당황했다고 해서 구경하러 갔죠, 그런데 보고 오니 내 여자 친구를 만난 거예요 보자마자 눈물이 났어요.\n" +
                        "\n" +
                        "\n" +
                        "이렇게 치환할 수 있어\n" +
                        "아래 상황을 적절하게 치환해줘\n";
            case 1:
                return "내가 하는 말을 아래 밈(템플릿) 양식에 맞춰서 치환해줘 \n" +
                        "\n" +
                        "안녕히 계세요 여러분~ 전 이 세상의 모든 굴레와 속박을 벗어던지고 제 행복을 찾아 떠납니다~\n" +
                        "\n" +
                        "\n" +
                        "예를 들면 이런식이야\n" +
                        "나는 이직에 성공 해서 행복해\n" +
                        "\n" +
                        "안녕히 계세요 여러분~ 전 이 직장의 모든 연봉과 업무를 벗어던지고 제 직장을 찾아 떠납니다~\n" +
                        "\n" +
                        "이렇게 치환할 수 있어\n" +
                        "아래 상황을 적절하게 치환해줘\n";
            case 2:
                return "내가 하는 말을 아래 밈(템플릿) 양식에 맞춰서 치환해줘 \n" +
                        "\n" +
                        "난… ㄱㅏ끔…\n" +
                        "눈물을 흘린ㄷㅏ…\n" +
                        "ㄱㅏ끔은 눈물을 참을 수 없는 ㄴㅐ가 별루ㄷㅏ…1\n" +
                        "맘이 ㅇㅏㅍㅏㅅㅓ…\n" +
                        "소ㄹㅣ 치며… 울 수 있ㄷㅏ는건…\n" +
                        "좋은ㄱㅓㅇㅑ…\n" +
                        "ㅁㅓ… 꼭 슬ㅍㅓㅇㅑ만우는건ㅇㅏ니잖아…^^\n" +
                        "난...눈물ㅇㅣ…좋다…\n" +
                        "ㅇㅏ니…\n" +
                        "ㅁㅓ리가ㅇㅏ닌…\n" +
                        "맘으로…우는ㄴㅐㄱㅏ좋다…”\n" +
                        "\n" +
                        "\n" +
                        "예를 들면 이런식이야\n" +
                        "내가 먹을려고 구운 소세지를 화장실 갖다온 사이 키우는 애완견이 다 먹은 상황을 \n" +
                        "\n" +
                        "난… ㄱㅏ끔… \n" +
                        "소세지를 도둑맞는ㄷㅏ…\n" +
                        "ㄱㅏ끔은 소세지를 참을 수 없는 애완견이 별루ㄷㅏ…\n" +
                        "소세지가 ㅇㅓㅂㅅㅇㅓㅅㅓ…\n" +
                        "소ㄹㅣ 치며… 울 수 있ㄷㅏ는건…\n" +
                        "좋은ㄱㅓㅇㅑ…\n" +
                        "ㅁㅓ… 꼭 슬ㅍㅓㅇㅑ만우는건ㅇㅏ니잖아…^^\n" +
                        "난...눈물ㅇㅣ…좋다…\n" +
                        "ㅇㅏ니…\n" +
                        "ㅁㅓ리가ㅇㅏ닌…\n" +
                        "맘으로…우는ㄴㅐㄱㅏ좋다…\n" +
                        "\n" +
                        "이렇게 치환할 수 있어\n" +
                        "아래 상황을 적절하게 치환해줘\n";
            case 3:
                return "내가 하는 말을 아래 밈(템플릿) 양식에 맞춰서 치환해줘 \n" +
                        "\n" +
                        "내가 그쪽을 좋아한 걸 왜 사과해야 되요? 남자가 여자 좋아한게 무슨 문제라고.\n" +
                        "만약 사과를 할려면 그쪽이 해야지.\n" +
                        "나는 그쪽이 좋은데 그쪽은 내가 싫으니까,\n" +
                        "싫어서 미안하다고 그쪽이 사과해야 되는 거아니예요?\n" +
                        "사과해요, 나한테! \n" +
                        "\n" +
                        "예를 들면 이런식이야\n" +
                        "\n" +
                        "나는 지금 주식이 떨어 졌어\n" +
                        "\n" +
                        "내가 주식이 떨어진 걸 왜 슬퍼해야 되요? 주식이 떨어지는게 무슨 문제라고.\n" +
                        "만약 사과를 할려면 업체쪽이 해야지.\n" +
                        "나는 주식이 좋은데 주식은 떨어 졌으니니까,\n" +
                        "떨어져서 미안하다고 업체가 사과해야 되는 거아니예요?\n" +
                        "사과해요, 나한테! \n" +
                        "\n" +
                        "\n" +
                        "이렇게 치환할 수 있어\n" +
                        "아래 상황을 적절하게 치환해줘\n";
            case 4:
                return "내가 하는 말을 아래 밈(템플릿) 양식에 맞춰서 치환해줘 \n" +
                        "\n" +
                        "내가 연습 끝나고 물을 먹으려고 하는데 글쎄 물이 딱 반 정도 남은거양!! 다 먹기엔 너무 많고 덜 먹기엔 너무 적고 그래서 딱 반만 있었으면 좋겠다고 생각했는데 \uD83E\uDD2D\uD83E\uDD2D완전 럭키비키잔앙\uD83C\uDF40\n" +
                        "\n" +
                        "예를 들면 이런식이야\n" +
                        "\n" +
                        "나는 지금 주식이 떨어 졌어\n" +
                        "\n" +
                        "내가 주식을 보려고 들어갔는데 글쎄 하안가를 찍은거양!! 더 사기엔 부담스럽고 더 사기엔 돈이 없고 그래서 딱 떨어졌으면 좋겠다고 생각했는데 \uD83E\uDD2D\uD83E\uDD2D완전 럭키비키잔앙\uD83C\uDF40\n" +
                        "\n" +
                        "\n" +
                        "이렇게 치환할 수 있어\n" +
                        "아래 상황을 적절하게 치환해줘\n";
            case 5:
                return "내가 하는 말을 아래 밈(템플릿) 양식에 맞춰서 치환해줘\n" +
                        "\n" +
                        "으에 므으에 으게 (뭐예요?) 응? 응? 으응? 오옥 빠스잖아?\n" +
                        "\n" +
                        "예를 들면 이런식이야\n" +
                        "닭강정인줄 알고 먹었는데 코다리 강정이였어\n" +
                        "\n" +
                        "어디 닭가정 먹어 봅시다 으에 므으에 으게 (뭐예요?) 응? 응? 으응? 오옥 코다리잖아?\n" +
                        "\n" +
                        "이렇게 치환할 수 있어\n" +
                        "아래 상황을 적절하게 치환해줘\n";
            default:
                return "상황: '%s'와 템플릿이 정의되지 않았습니다.";
        }
    }

    // 포맷팅된 문장을 반환하는 메서드
    public static String formatTemplate(Long memeId) {
        String template = getTemplateById(memeId);
        return String.format(template);
    }
}
